var    bookHref = ["سر التقوي.pdf", "سر التقوي.pdf", "نور أشرق في الظلمة.pdf", "الصخرة الارثوذكسية - محاضرات عقائدية في تفنيد التعاليم الغربية - القديس الارشيذياكون حبيب جرجس.pdf", "المبادئ المسيحية الارثوذكسية للمدارس الثانوية - الكتاب الأول - القديس الارشيذياكون حبيب جرجس.pdf", "المبادئ المسيحية الارثوذكسية للمدارس الثانوية - الكتاب الثاني - القديس الارشيذياكون حبيب جرجس.pdf", "المبادئ المسيحية الارثوذكسية للمدارس الثانوية - الكتاب الثالث - القديس الارشيذياكون حبيب جرجس.pdf", "المبادئ المسيحية الارثوذكسية للمدارس الثانوية - الكتاب الرابع - القديس الارشيذياكون حبيب جرجس.pdf", "مرشد المدارس في الصلوات وحضور الكنائس.pdf", "الترنيمات الروحية للكنيسة القبطية - القديس الارشيذياكون حبيب جرجس.pdf", "أسرار الكنيسة السبعة.pdf", "العهد الجديد ترجمة القديس حبيب جرجس من النص القبطي البحيري 1935 .pdf", "القديس مرقس الانجيلي - مؤسس الكنيسة المصرية - القديس الارشيذياكون حبيب جرجس - أ.كامل جرجس.pdf", "الكنز الانفس في ملخص الكتاب والتاريخ المقدس - القديس الارشيذياكون حبيب جرجس.pdf", "الوسائل العملية للاصلاحات القبطية - امال واحلام - القديس الارشيذياكون حبيب جرجس.pdf", "نظرات روحية فى الحياة المسيحية - القديس الارشيذياكون حبيب جرجس .pdf"],
bookImgs = ["2.jpg", "3.jpg", "18.jpg", "7.jpg", "13.jpg", "14.jpg", "15.jpg", "16.jpg", "4.jpg", "8.jpg", "1.jpg", "9.jpg", "11.jpg", "12.jpg", "17.jpg", "5.jpg"],
bookTxt = ["كتاب سر التقوي - القديس الأرشيدياكون حبيب جرجس .", "كتاب عزاء المؤمنين - القديس الأرشيدياكون حبيب جرجس .", "كتاب نور أشرق في الظلمة - القديس الأرشيدياكون حبيب جرجس .", "كتاب الصخرة الارثوذكسية - القديس الأرشيدياكون حبيب جرجس .", "كتاب المبادئ المسيحية الارثوذكسية للمدارس الثانوية + الكتاب الأول + .", "كتاب المبادئ المسيحية الارثوذكسية للمدارس الثانوية + الكتاب الثاني + .", "كتاب المبادئ المسيحية الارثوذكسية للمدارس الثانوية + الكتاب الثالث + .", "كتاب المبادئ المسيحية الارثوذكسية للمدارس الثانوية + الكتاب الرابع + .", "كتاب مرشد المدارس في الصلوات وحضور الكنائس - حبيب جرجس .", "كتاب الترنيمات الروحية للكنيسة القبطية - القديس حبيب جرجس .", "كتاب أسرار الكنيسة السبعة - القديس الارشيذياكون حبيب جرجس .", "كتاب العهد الجديد ترجمة القديس حبيب جرجس من النص القبطي البحيري .", "كتاب القديس مرقس الانجيلي - القديس حبيب جرجس - أ.كامل جرجس .", "كتاب الكنز الأنفس - القديس الأرشيدياكون حبيب جرجس .", "كتاب الوسائل العملية للاصلاحات القبطية - القديس حبيب جرجس .", "كتاب نظرات روحية فى الحياة المسيحية - القديس حبيب جرجس ."];


/*************************** books-Search **************************************************************/
$(document).ready(function () {
    var value = '';

    $("#results").hide();
    

    $("#searchValue").keyup(function (a) {
        value = $("#searchValue").val();

        if (value === '') {
            $("#results").hide('fade');
            $("#pageContaints").show('fade');
        } else {
            $("#results").show('fade');
            $("#pageContaints").hide('fade');
        }

        var results = [];

        bookTxt.forEach((element2, index) => {
            if (element2.indexOf(value) !== -1) {
                var images = bookImgs[index],
                    links = bookHref[index];

                var tagElement = '<div class="col-lg-3 col-md-4 col-sm-6 col-xs-12">' +
                    '<center>' +
                    '<div class="gallery"><a href="' + links + '" target="_blank"><img src="' + images + '" class="img-responsive"><div class="desc">' + element2 + '</div> </a>' + '</div></center></div>';

                results.push(tagElement);
            }
        });
        if (results.length === 0) {
            var noResultTxt = '<h1 style="text-align: center;"> لا توجد نتائج للبحث </h1>';
            results.push(noResultTxt);
        }

        $("#bResults").html(results);
    });
});