var imgs = ["1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg", "6.jpg", "7.jpg", "8.jpg", "9.jpg", "10.jpg", "11.jpg", "12.jpg", "13.jpg", "14.jpg", "15.jpg", "16.jpg", "17.jpg", "18.jpg", "19.jpg", "20.jpg", "21.jpg", "22.jpg", "23.jpg", "24.jpg", "25.jpg", "26.jpg", "27.jpg", "28.jpg", "29.jpg", "30.jpg", "31.jpg", "32.jpg", "33.jpg", "34.jpg", "35.jpg", "36.jpg", "37.jpg", "38.jpg", "39.jpg", "40.jpg", "41.jpg", "42.jpg", "43.jpg", "44.jpg", "45.jpg", "46.jpg", "47.jpg", "48.jpg", "49.jpg", "50.jpg", "51.jpg", "52.jpg", "53.jpg", "54.jpg", "55.jpg", "56.jpg", "57.jpg", "58.jpg", "59.jpg", "60.jpg", "61.jpg", "62.jpg", "63.jpg", "64.jpg", "65.jpg", "66.jpg", "67.jpg", "68.jpg", "69.jpg", "70.jpg", "71.jpg", "72.jpg", "73.jpg", "74.jpg", "75.jpg", "76.jpg", "77.jpg", "78.jpg", "79.jpg", "80.jpg", "81.jpg", "82.jpg", "83.jpg", "84.jpg", "85.jpg", "86.jpg", "87.jpg", "88.jpg", "89.jpg", "90.jpg", "91.jpg", "92.jpg", "93.jpg", "94.jpg", "95.jpg", "96.jpg", "97.jpg", "98.jpg", "99.jpg", "100.jpg", "101.jpg", "102.jpg", "104.jpg", "105.jpg", "106.jpg", "107.jpg", "108.jpg", "109.jpg", "110.jpg", "111.jpg", "112.jpg", "113.jpg", "114.jpg", "115.jpg", "116.jpg", "117.jpg", "118.jpg", "119.jpg", "120.jpg", "121.jpg", "122.jpg", "123.jpg", "124.jpg", "125.jpg", "126.jpg", "127.jpg", "128.jpg", "129.jpg", "130.jpg", "131.jpg", "132.jpg", "133.jpg"],
    txt = ["العدد الرابع - السنة الأولي .", "العدد السادس - السنة الأولي .", "العدد التاسع - السنة الأولي .", "العدد الأول - السنة الثانية .", "العدد الثاني - السنة الثانية .", "العدد الثالث - السنة الثانية .", " العدد الخامس - السنة الثانية .", "العدد السابع - السنة الثانية .", "العدد السادس - السنة الثانية .", "العدد التاسع - السنة الثانية .", "العدد التاسع - السنة الثالثة .", "العدد العاشر - السنة الثالثة .", "العدد الأول - السنة الرابعة .", "العدد الثاني - السنة الرابعة .", "العدد الثالث - السنة الرابعة .", "العدد الرابع - السنة الرابعة .", "العدد الخامس - السنة الرابعة .", "العدد السادس - السنة الرابعة .", "العدد السابع - السنة الرابعة .", "العدد الثامن - السنة الرابعة .", "العدد التاسع - السنة الرابعة .", "العدد العاشر - السنة الرابعة .", "العدد الأول - السنة الخامسة .", "العدد الثاني - السنة الخامسة .", "العدد الثالث - السنة الخامسة .", "العدد الرابع - السنة الخامسة .", "العدد الخامس - السنة الخامسة .", "العدد السادس - السنة الخامسة .", "العدد السابع - السنة الخامسة .", "العدد الثامن - السنة الخامسة .", "العدد التاسع - السنة الخامسة .", "العدد العاشر - السنة الخامسة .", "العدد الأول - السنة السادسة .", "العدد الثاني - السنة السادسة .", "العدد الثالث - السنة السادسة .", "العدد الرابع - السنة السادسة .", "العدد الخامس - السنة السادسة .", "العدد السادس - السنة السادسة .", "العدد السابع - السنة السادسة .", "العدد الثامن - السنة السادسة .", "العدد التاسع - السنة السادسة .", "العدد العاشر - السنة السادسة .", "العدد الأول - السنة التاسعة .", "العدد الثاني - السنة التاسعة .", "العدد الثالث - السنة التاسعة .", "العدد الرابع - السنة التاسعة .", "العدد الخامس - السنة التاسعة .", "العدد السادس - السنة التاسعة .", "العدد السابع - السنة التاسعة .", "العدد الثامن - السنة التاسعة .", "العدد التاسع - السنة التاسعة .", "العدد العاشر - السنة التاسعة .", "العدد الأول - السنة العاشرة .", "العدد الثاني - السنة العاشرة .", "العدد الثالث - السنة العاشرة .", "العدد الرابع - السنة العاشرة .", "العدد الخامس - السنة العاشرة .", "العدد السادس - السنة العاشرة .", "العدد السابع - السنة العاشرة .", "العدد الثامن - السنة العاشرة .", "العدد التاسع - السنة العاشرة .", "العدد العاشر - السنة العاشرة .", "العدد الأول - السنة الحادية عشر .", "العدد الثاني - السنة الحادية عشر .", "العدد الثالث - السنة الحادية عشر .", "العدد الرابع - السنة الحادية عشر .", "العدد الخامس - السنة الحادية عشر .", "العدد السادس - السنة الحادية عشر .", "العدد السابع - السنة الحادية عشر .", "العدد الثامن - السنة الحادية عشر .", "العدد التاسع - السنة الحادية عشر .", "العدد العاشر - السنة الحادية عشر .", "العدد الأول - السنة الثانية عشر .", "العدد الثاني - السنة الثانية عشر .", "العدد الثالث - السنة الثانية عشر .", "العدد الرابع - السنة الثانية عشر .", "العدد الخامس - السنة الثانية عشر .", "العدد السادس - السنة الثانية عشر .", "العدد السابع - السنة الثانية عشر .", "العدد الثامن - السنة الثانية عشر .", "العدد التاسع - السنة الثانية عشر .", "العدد العاشر - السنة الثانية عشر .", "العدد الأول - السنة الثالثة عشر .", "العدد الثاني - السنة الثالثة عشر .", "العدد الثالث - السنة الثالثة عشر .", "العدد الرابع - السنة الثالثة عشر .", "العدد الخامس - السنة الثالثة عشر .", "العدد السادس - السنة الثالثة عشر .", "العدد السابع - السنة الثالثة عشر .", "العدد الثامن - السنة الثالثة عشر .", "العدد التاسع - السنة الثالثة عشر .", "العدد العاشر - السنة الثالثة عشر .", "العدد الأول - السنة الرابعة عشر .", "العدد الثاني - السنة الرابعة عشر .", "العدد الثالث - السنة الرابعة عشر .", "العدد الرابع - السنة الرابعة عشر .", "العدد الخامس - السنة الرابعة عشر .", "العدد السادس - السنة الرابعة عشر .", "العدد السابع - السنة الرابعة عشر .", "العدد الثامن - السنة الرابعة عشر .", "العدد التاسع - السنة الرابعة عشر .", "العدد العاشر - السنة الرابعة عشر .", "العدد الثاني - السنة الخامسة عشر .", "العدد الثالث - السنة الخامسة عشر .", "العدد الرابع - السنة الخامسة عشر .", "العدد الخامس - السنة الخامسة عشر .", "العدد السادس - السنة الخامسة عشر .", "العدد السابع - السنة الخامسة عشر .", "العدد الثامن - السنة الخامسة عشر .", "العدد التاسع - السنة الخامسة عشر .", "العدد العاشر - السنة الخامسة عشر .", "العدد الأول - السنة السادسة عشر .", "العدد الثاني - السنة السادسة عشر .", "العدد الثالث - السنة السادسة عشر .", "العدد الرابع - السنة السادسة عشر .", "العدد الخامس - السنة السادسة عشر .", "العدد السادس - السنة السادسة عشر .", "العدد السابع - السنة السادسة عشر .", "العدد الثامن - السنة السادسة عشر .", "العدد التاسع - السنة السادسة عشر .", "العدد العاشر - السنة السادسة عشر .", "العدد الأول - السنة السابعة عشر .", "العدد الثاني - السنة السابعة عشر .", "العدد الثالث - السنة السابعة عشر .", "العدد الرابع - السنة السابعة عشر .", "العدد الخامس - السنة السابعة عشر .", "الـعـدد الـسـادس - الـسـنـة الـسـابـعـة عـشـر .", "الـعـدد الـسـابـع - الـسـنـة الـسـابـعـة عـشـر .", "الـعـدد الـثـامـن - الـسـنـة الـسـابـعـة عـشـر .", "العددان التاسع و العاشر - السنة السابعة عشر .", "العدد الخامس - السنة الأولي .", "العدد الثالث - السنة الأولي ."],
    href = ["1.pdf", "2.pdf", "3.pdf", "4.pdf", "5.pdf", "6.pdf", "7.pdf", "8.pdf", "9.pdf", "10.pdf", "11.pdf", "12.pdf", "13.pdf", "14.pdf", "15.pdf", "16.pdf", "17.pdf", "18.pdf", "19.pdf", "20.pdf", "21.pdf", "22.pdf", "23.pdf", "24.pdf", "25.pdf", "26.pdf", "27.pdf", "28.pdf", "29.pdf", "30.pdf", "31.pdf", "32.pdf", "33.pdf", "34.pdf", "35.pdf", "36.pdf", "37.pdf", "38.pdf", "39.pdf", "40.pdf", "41.pdf", "42.pdf", "43.pdf", "44.pdf", "45.pdf", "46.pdf", "47.pdf", "48.pdf", "49.pdf", "50.pdf", "51.pdf", "52.pdf", "53.pdf", "54.pdf", "55.pdf", "56.pdf", "57.pdf", "58.pdf", "59.pdf", "60.pdf", "61.pdf", "62.pdf", "63.pdf", "64.pdf", "65.pdf", "66.pdf", "67.pdf", "68.pdf", "69.pdf", "70.pdf", "71.pdf", "72.pdf", "73.pdf", "74.pdf", "75.pdf", "76.pdf", "77.pdf", "78.pdf", "79.pdf", "80.pdf", "81.pdf", "82.pdf", "83.pdf", "84.pdf", "85.pdf", "86.pdf", "87.pdf", "88.pdf", "89.pdf", "90.pdf", "91.pdf", "92.pdf", "93.pdf", "94.pdf", "95.pdf", "96.pdf", "97.pdf", "98.pdf", "99.pdf", "100.pdf", "101.pdf", "102.pdf", "104.pdf", "105.pdf", "106.pdf", "107.pdf", "108.pdf", "109.pdf", "110.pdf", "111.pdf", "112.pdf", "113.pdf", "114.pdf", "115.pdf", "116.pdf", "117.pdf", "118.pdf", "119.pdf", "120.pdf", "121.pdf", "122.pdf", "123.pdf", "124.pdf", "125.pdf", "126.pdf", "127.pdf", "128.pdf", "129.pdf", "130.pdf", "131.pdf", "132.pdf", "133.pdf"];

/*********************** karma's-Informations *****************************************************/
$(document).ready(function () {
    var isClicked = false;
    $("#info1").hide();
    $("#info2").hide();

    $("#info").click(function () {
        if (isClicked === false) {
            $("#info1").show('fade');
            $("#info2").show('fade');

            isClicked = true;
            $("#info").css("color", "#337ab7");
        } else {
            $("#info1").hide('fade');
            $("#info2").hide('fade');

            isClicked = false;
            $("#info").css("color", "black");
            
        }
    });

});
/******** karma's search ********************************************************************************/
$(document).ready(function () {
    var val = '';

        $("#searchResult").hide();
    

    $('#searchVal').keyup(function (e) {
        val = $('#searchVal').val();

        if (val === '') {
            $("#searchResult").hide('fade');
            $("#detailInfo").show('fade');
        } else {
            $("#searchResult").show('fade');
            $("#detailInfo").hide('fade');
        }

        var result = [];

        txt.forEach((element, index) => {
            if (element.indexOf(val) !== -1) {
                var img = imgs[index],
                    link = href[index];


                var tagElemnt = '<div class="col-lg-3 col-md-4 col-sm-6 col-xs-12">' +
                    '<center>' +
                    '<div class="gallery"><a href="' + link + '" target="_blank"><img src="' + img + '" class="img-responsive"><div class="desc">' + element + '</div> </a>' + '</div></center></div>';

                result.push(tagElemnt);
            }
        });

        if (result.length === 0) {
            var noResulttxt = '<h1 id="noResult" style="text-align: center; margin-bottom: 20px;"> لا توجد نتائج للبحث </h1>';
            result.push(noResulttxt);
        }

        $("#result").html(result);
    });

});

